Revit 2027 API
FamilySource Enumeration
 Describes which version of the family to be loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FamilySource
Public Enumeration FamilySource
public enum class FamilySource
type FamilySource
Members
Member name | Value | Description
Family | 1 |  Loading the family from current family document.
Project | 0 |  Loading the family from target project document.
See Also
Reference
Autodesk.Revit.DB Namespace